# Дан список чисел. Определите, сколько в нем встречается
# различных чисел.

list_nums = [1, 2, 3, 1, 1, 5, 10, 20, 20, 30]
amount = len(set(list_nums))
print(amount)
